package com.example.recyclevapp;

public class MyData {

    public static String[] s_Name = {"אילן רוזנפלד", "עודד פז", "קובי פרג'", "אלונה טל", "יניב פולישוק", "אלי-קרן אסף", "קובי פרג'","ימית סול", "דנה פרידר", "יובל סגל"};
    public static String[] s_Description = setDescription();
    private static String[]  setDescription()
    {
         String[] desciption = new String[10];
        desciption[0] = "קלידן וסולן הלהקה. נוהג להתייאש מכישלונה של הלהקה, ולהיות מריר וביקורתי מאוד. לעיתים נחשב לאדם הכי יציב רגשית בלהקה, ולעיתים נוטה להשתפכויות ילדותיות." ;
        desciption[1] = "מתופף הלהקה. מוצג ככסיל ומאוד ילדותי בעקבות זאת נלעג על ידי דמויות רבות. עודד עובד בזמנו הפנוי בהמבורגרי של גרי, המכנה אותו 'דיביל'.";
        desciption[2] = "הגיטריסט של הלהקה. מגלם גם דמויות נוספות שהן השלכה מאישיותו - הוא מוצג כבעל הפרעת זהות דיסוציאטיבית חמורה, אך הוא נוהג לנצל אותה למטרותיו האישיות. כחלק מפיצול האישיות, מגלם את האמרגן פרדי נייס־טו־מיט, הקשיש העיראקי נג'י קומרדין ג'קסון ועוד.";
        desciption[3]= "זמרת ליווי בלהקה. אהובה מאוד על יתר חברי הלהקה, שלא זכו לחיבה דומה ממנה. טרם העונה הרביעית עזבה לארצות הברית.";
        desciption[4]= "הדוד של קובי. בעל מסעדת המבורגרים כושלת בשם 'ההמבורגרי של גרי' בתחתית הבניין בו גרים הפיג'מות. אדם ממורמר, קמצן, קשוח, ולפעמים ילדותי. שונא את עבודתו ואת הסדרה עצמה, והרבה פעמים רוצה שהיא תסתיים. נוהג לצעוק 'למה?!' בקול גבוה וצפצפני כאשר צצות בעיות. מאשים את בני משפחתו ברוב הצרות שלו. בעונה החמישית מתברר שיש לו תאום בשם ברי.";
        desciption[5]= "בתו הבכורה של גרי. אופורטוניסטית, ולעיתים גם מניפולטיבית, מכונה על ידי גרי 'רונקיפליץ'.";
        desciption[6]= "האמרגן פרדי נייס־טו־מיט, חלק מדמותו של קובי פרג', פרדי הוא אמרגן הלהקה ודואג לשיווק שלה, המילה הידוע שלו היא 'טירוף'. ";
        desciption[7]= "נגנית כלי הקשה. בעלת תואר שני בפסיכולוגיה קלינית. בעונה החמישית החלה לעבוד על תזה, ובעונה השביעית החלה לימודים לדוקטורט.";
        desciption[8]= "בסיסטית בלהקה. עובדת בהמבורגרי בתור מנהלת חשבונות. דנה היא האחיינית של שפרה, אשתו של גרי.";
        desciption[9]= " נתן קופרמן, בן דודו של אילן שמשמש כ-DJ בלהקה. עבד פעם ב-MTV, אך פוטר בעונה 4. נחשב חכם ומוכשר מאוד, אפילו שמדי פעם מתנהג באופן ילדותי ובוכה הרבה בכל פרק. לאורך כל הסדרה נתן מוצג כאיש אמיד.";
        return desciption;
    }
    public static Integer[] s_ImageSrc = {R.drawable.ilan, R.drawable.oded, R.drawable.kobi,
            R.drawable.alona, R.drawable.gri, R.drawable.roni,
            R.drawable.fredi, R.drawable.yamit, R.drawable.dana,R.drawable.natan};

    public static Integer[] s_ID = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};

}
